[
    {
        "module": "Governance and leadership",
        "quality_objective": "Leadership is responsible and accountable for quality",
        "risks": [
            {
                "description": "Those with ultimate and operational responsibility may not have the time, knowledge or resources to implement the system of quality management",
                "assessment": "The MP is solely responsible for the implementation of the ISQM 1, time may be limited.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm shall determine that the individual(s) who are assigned responsibility has the appropriate experience, knowledge, influence and authority within the firm, and sufficient time, to fulfil their assigned responsibility and understands their assigned roles and that they are accountable for fulfilling them. (ISQM1.21)\n\nSpecific milestones for quality management with timelines  will be incorparated in to our Risk dashboard.",
                "response": "1. Annual review of the SoQM has been booked in to the calenders of the the MP and the Business Analyst. \n\n2. The annual file reivew scheudles have also been booked in the directors calander.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The quality objectives may need to change due to a change in the circumstances of the entity and this may not be identified or acted upon",
                "assessment": "This may always be a risk as any change in the entity can cause a change in the risk assessment.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm shall establish policies or procedures that are designed to identify information that indicates additional quality objectives, or additional or modified quality risks or responses, are needed due to changes in the nature and circumstances of the firm or its engagements. Based on this evaluation, the firm shall establish additional quality objectives or modify additional quality objectives, identify and assess additional quality risks, modify the quality risks or reassess the quality risks or design and implement additional responses, or modify the responses.",
                "response": "Annual considerations of current circumstances to identify possible changes. \n\nEITHER:\na) No changes were identified OR\nb) changes to the nature and circumstances of the firm was identified and the risk assessment was updated accordingly",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Those with ultimate and operational responsibility may not perform their duties in such a way to provide for a proper SOQM",
                "assessment": "The response is required by the ISQM, regardless of the risk assessed, and as such must always form part of the responses. This is always a risk, no matter how competent an individual is, there is always the risk that they may be negligent.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm shall undertake periodic performance evaluations of the individual(s) assigned ultimate responsibility and accountability for the system of quality management, and the individual(s) assigned operational responsibility for the system of quality management. In doing so, the firm shall take into account the evaluation of the system of quality management. (ISQM 1.56)\n\nThe firm shall use a peer review process. The outcome of monitoring activities may provide feedback on the performance.",
                "response": "The firm shall use a peer review process. The outcome of monitoring activities may provide feedback on the performance.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The risk that the financial and operational decisions of the firm contradicts their commitment to quality.\n1. Fee\n2. Acceptance procedures",
                "assessment": "The only way to demonstrate commitment to quality is thorugh the work we perform. \nWe need to consider the risk that external parties may conclude that we are not committed to quality.\n\nClients may be accepted in a way that indicates the firm just wants to take on more clients, without evaluating risks.\n\nClients may not be willing to pay the fee required",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Clients are accepted based on formal procedures, including evaluation of the fees. Where the client does not accept the fee and we cannot perform the engagement at the fee they are willing to pay we will decline.\n\nServices such as tax and bookkeeping are provided at fixed fees.\n\nServices such as audits and reviews are provided based on hourly rates",
                "response": "Refer to acceptance documents on engagement files",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The leadership may not act in a way consistent with quality.",
                "assessment": "The composition of the firm creates a risk where the managing partner may not act in a way that is consistent with quality but nothing is done.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The responses as discussed above all contribute creating an example of commitment to quality.\n\nClient feedback will be received.\n\nClients will be made aware of the fact that they can complain to regulatory bodies.",
                "response": "The system of quality management will be reviewed  annually, this will included the assessment of leaderships actions and behavious to quality.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The firm may not have sufficient time to ensure all the requirements are met, or may be faced with a self review threat when it comes to monitoring their own work.",
                "assessment": "The firm is a small firm with the managing partner who is taking full responsibility for the ISQM system of quality management",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The system of quality management will be reviewed once a year.",
                "response": "The system of quality management will be reviewed once a year.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Service providers utilised within the system of quality management itself may not be appropriate or may not have authority within the firm to perform their tasks.",
                "assessment": "We do not make use of  external service providers. Hence  this risk is not applicable.",
                "likelihood": "No",
                "adverse_effect": "No",
                "risk_applicable": "nan",
                "response": "NA",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The attitude towards ISQM1 is such that the firm does not see the benefit for the cost involved and as such do not allocate proper resources to the development and maintenance on this system.",
                "assessment": "The leadership takes full responsibility. The fact that a SoQM has been implemented (as evidenced by this risk assessment and other documentation) indicates that this is not a risk.",
                "likelihood": "No",
                "adverse_effect": "No",
                "risk_applicable": "nan",
                "response": "nan",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Firm's financial goals are overly dependent on services not within the scope of ISQM and therefore resources are allocated in a way that prioritises these services. This can negatively impact the quality of the engagements within the scope of ISQM 1",
                "assessment": "Complex assignments for which we do not have the capacity to perform will not be accepted.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "We shall not have incentives in place that are focused on financial and operational priorities that may discourage behaviours that demonstrate a commitment to quality. (ISQM1.A56)\n\nResources shall be allocated in a manner that is consistent with commitment to quality. refer to resources tab",
                "response": "Resources considertation is allways performed during the client acceptance phase.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "See resources section for more detailed risks and responses",
                "assessment": "Consider your clients vs your firm's resources - do you have the necessary resources (financial, people, software, etc) to provide quality engagements? - Consider this on the resources tab\n\nFeedback from evaluations, inspections, clients, etc. can be used to make this evaluation.\n\nBudgets - are you actually meeting your budgets",
                "likelihood": "nan",
                "adverse_effect": "nan",
                "risk_applicable": "nan",
                "response": "nan",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            }
        ]
    },
    {
        "module": "Ethical requirements",
        "quality_objective": "The firm and its personnel:\n(i) Understand the relevant ethical requirements to which the firm and the firm’s engagements are subject; and\n\n(ii) Fulfil their responsibilities in relation to the relevant ethical requirements to which the firm and the firm’s engagements are subject.",
        "risks": [
            {
                "description": "Employees may know the ethical requirements but may not comply with them.",
                "assessment": "We may act unethical, but the only recourse may be if another party complains to the regulatory body.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm obtains, at least annually, a documented confirmation of compliance with independence requirements from all personnel required by relevant ethical requirements to be independent",
                "response": "Annaul independence and confidentiality confirmaiton.\nEngagement team members are also required  to complete independence declaration on each engagement.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Threats may not be identified and responded  to due to bias on the side of the leadership.",
                "assessment": "All situations that could lead to ethical threats as per the code needs to be considered for responses.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm has established policies and procedures for identifying, evaluating and addressing threats to compliance with relevant ethical requirements. This includes:\n\nThe acceptance process will identify and respond to breaches at firm level\n\nWe will evaluate all necessary factors from the code to identify possible breaches and deal with them accordingly",
                "response": "Acceptance and continuance procedures are followed for each client. \nAnnual reivew of the SOQM will also highlight any threats.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Audit tenure of the firm may cause familiarity threats that can cause the firm to not comply with ethical requirements",
                "assessment": "We only have one assurnace partner.\nOnce the partnership increase  partner rotation will be implemented.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Regulatory requirements for rotation to be complied with",
                "response": "Once the partnership increase  partner rotation will be implemented.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Individuals utilised from service providers may not: \n\nBe aware of the ethical requirements applicable to them due to their service to our firm\n\nComply with the ethical requirements\n\nReport breaches to the relevant individuals",
                "assessment": "The firm does not form part of a network.\n\nExternal service providers may be used as and when necessary on an ad hoc-basis. These individuals will be evaluated when used.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm shall evaluate the sources from which human resources are utilised in order to identify if they are aware of ethical considerations and the relevant code of conduct. Refer to resources section for this.\n\nThe firm shall evaluate the individuals who provide services to identify if they are aware of, and compliant with the relevant ethical requirements\n\nThe individual shall sign an ethical declaration before providing services\n\nThe engagement partner shall inform these individuals of the specific ethical requirements on the engagement for which they are providing a service, and the process for communicating identified breaches.",
                "response": "We have evaluated external resource providers such as service providers.\nSee annexure 6.4\n\nEngagement partners have evaluated the individuals assigned to their engagement from  service providers\nSee annexure 6.5\n\nAnnexure 4.3 has been signed by these individuals at engagement level\n\nThese individuals have been included in engagement meetings",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            }
        ]
    },
    {
        "module": "Acceptance and continuance",
        "quality_objective": "Judgments by the firm about whether to accept or continue a client relationship or specific engagement are appropriate based on:\n(a) Information obtained about the nature and circumstances of the engagement and the integrity and ethical values of the client (including management, and, when appropriate, those charged with governance) that is sufficient to support such judgments, and\n(b) The firm’s ability to perform the engagement in accordance with professional standards and applicable legal and regulatory requirements.",
        "risks": [
            {
                "description": "Information may become available after acceptance that would have caused the entity to not accept the engagement, and this information may not be taken into account or considered",
                "assessment": "This can happen in any engagement and as such will always be a risk\n\nThis risk is double sided, either the information will not be communicated, or it will not be properly considered.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm establishes policies or  procedures that address circumstances when the firm becomes aware of information subsequent to accepting or continuing a client relationship or specific engagement that would have caused it to decline the client relationship or specific engagement had that information been known prior to accepting or continuing the client relationship or specific engagement",
                "response": "If, after accepting or continuing an engagement, the firm receives information, which, if known earlier, would have resulted in a refusal of the engagement, the firm must consider whether to continue the engagement and will normally seek legal advice regarding its position and options to ensure that it meets all relevant professional, regulatory, and legal requirements.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The firm may be required by law or regulation to accept the client relationship or specific engagement, even where they would have decided to decline the engagement",
                "assessment": "This is not applicable to the firm as all our client acceptance is guided by our firm policy.\nWe however perform audit on regulated entitites, should we no longer desire to continue the client relationship we are obligated to inform the regulator",
                "likelihood": "No",
                "adverse_effect": "NO",
                "risk_applicable": "The firm establishes policies or procedures that address circumstances when the firm is obligated by law or regulation to accept a client relationship or specific engagement",
                "response": "If there is a professional, regulatory or legal requirement which compels the firm to continue the engagement, the reasons for continuance should be documented, including consideration of consultation with the legal counsel.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The firm may not be truly independent due to other services being provided to audit clients or the fee charged to the client\n\nEthical threats may not be appropriately identified or responded to by the team, or may not be communicated or documented correctly",
                "assessment": "It may happen where the firm needs to perform a compilation engagement as well as the audit engagement.\n\nFrom prior monitoring and inspection outcomes, you may have identified breaches in the past that have not been identified.\n\nThis risk is also increased where employees are not aware of, or have knowledge of, the requirements of the code\n\nPlease refer to the ethical considerations tab for more detail",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The frim shall only accept an engagement if I have the ability to perform the engagement, including the ability to fulfil the relevant ethical requirements \n\nEthical evaluations are performed at engagement level and if threats are identified they will be responded to",
                "response": "Evaluated clients in terms of independence requirements.\n\nFor all audit client complete Appendix C of the Quality control manual on the audit file.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The firm fails to re-evaluate the client on recurring engagements",
                "assessment": "nan",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Complete the client acceptance checklist every year",
                "response": "For all audit client complete Appendix C of the Quality control manual on the audit file.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Audit fees vs non audit fees may lead to independence threats\n\nFinancially overly reliant on the client",
                "assessment": "The firm provides audit and non-assurance services to the same clients. The fees may lead to an independence threat\n\nWe will evaluate whether we are over reliant on clients.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "We shall not have incentives in place that are focused on financial and operational priorities that may discourage behaviours that demonstrate a commitment to quality. (ISQM1.A56)\n\nThe firm shall not accept clients where the fee charged may lead to independence threats\n\nTo perform EQR on engagements where the fees may lead to independence threats",
                "response": "Where it is identified that the audit fee or other fee may cause independence issues, we will implement safeguards such as \n1. EQR.\n2. Not accepting the client.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Financial objectives may override that of quality",
                "assessment": "This will always be a risk regardless of the nature of the entity",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "It is firm policy to only accept a client after the proper acceptance procedures were followed as identified above. No client may be accepted unless we comply with the necessary competence, resources and ethical requirements\n\nFirm policy to perform a yearly planning of resource needs vs resource availability to ensure we can continue with all our client engagements.\n\nWhere it is identified that resources may not be sufficient, resources shall be obtained in accordance with the procedures as set out under the resources tab.",
                "response": "For all audit client complete Appendix C of the Quality control manual on the audit file.\n\nYearly planning",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            }
        ]
    },
    {
        "module": "Engagement performance",
        "quality_objective": "Engagement teams understand and fulfil their responsibilities in connection with the engagements, including, as applicable, the overall responsibility of engagement partners for managing and achieving quality on the engagement and being sufficiently and appropriately involved throughout the engagement",
        "risks": [
            {
                "description": "All engagments are perfomed by an engagment team that will consist of atleast a Partner, Audit supervisor and an audit clerk. The selection of the audit team is dependent on the complexity and the resource requirement of the engagment.",
                "assessment": "All work papres are prepared using DCS work paper format.\nAll work paper are reivewed by a senior personal.\nAll review notes needs to be cleared before the senior sign of the work paper.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Work papers are reviewed by a senior/more experience staff.\nProof of review will be indicated inside the work paper as well as on the Case ware document manager.",
                "response": "Work paper sign off by all members envolved on that work paper  ( Preparer, reviewer & final reviewer)\nParner reivew is required for all work papers that contain a report item.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Engagment team members may not apply professional skepticism and judgement during the engagment.",
                "assessment": "Engagement team members are reminded during each engagment to remain objective and to maintain professional Skepticism.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Engagment team members should apply professional skepticism and judgement, based on their knowedge and experience.",
                "response": "During the engagment team planning discussion the team is reminded to maintain professinal skepticism.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Consultation may not take place or may not be documented.",
                "assessment": "It is always a risk that team members may not understand something properly and then need to consult.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm encourages consultation among the engagement team and, for significant matters, with others inside and, with authorization, outside the firm. Internal consultation uses the firm’s collective experience and technical expertise (or that available to the firm) to reduce the risk of error and improve the quality of engagement performance. A consultative environment improves the partner or staff’s learning and development process and adds strength to the firm’s collective knowledge base, quality management system, and professional capabilities.",
                "response": "List of items that may need to be consulted on (Engagement level)\n\nRecord of consultation where it has taken place (to be included in engagement file)\nWhere consultation is undertaken, this process will be documented using template documents ( Appendix E).",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Difference of opinion between engagment team members may occur.",
                "assessment": "Engagment team members are encouraged to discuss and document  contentious matters amongst the engagement team",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm and its partners and staff shall take any steps necessary, according to firm and professional standards, to adequately identify, consider, document, and resolve differences of opinion that may arise in a wide range of circumstances.",
                "response": "All partners and staff shall strive to be objective, conscientious, open-minded, and reasonable in assisting, facilitating, or reaching a timely and non-confrontational resolution of any disputes or differences of opinion.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "May not comply with the deadline as prescribed - different deadlines for different types of clients Retention.\nInformant Maybe shared or made available to third parties when this is not allowed.",
                "assessment": "During review process, the partner completes a checklist to ensure the file is complete and accurate.\n\nFiles are kept on the cloud and physical documents are kept on file in the office.\n\nAll hardcopy files are kept safely in the office.\n\nWhere third party access is required we will evaluate whether we are allowed to provide the information.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm has established policies and procedures designed to maintain the confidentiality, safe custody, integrity, accessibility, and retrievability of the engagement documentation.",
                "response": "All working papers, reports, and other documents prepared by the firm, including client-prepared worksheets, are confidential and shall be protected from unauthorized access.\nAn engagement partner or MP must approve all external requests to review working papers and any release of the documents will not be completed until this approval is obtained.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Significant lack of documented audit evidence at the engagement file level to support the audit opinion issued.",
                "assessment": "During review process, the engament team  completes a checklist to ensure the file is complete and accurate.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Proper review process\n\nChecklists for completeness of engagements",
                "response": "For each engagement the engagement (planning& completions) checklist has to be completed and reviewed.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Inadequate controls over the safe custody and\nmodifications of archived audit engagement files",
                "assessment": "IFAC indicates archiving after 60 days",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Firm policy requires that final assembly of the engagement file be completed within 60 days after the date of the audit report. If there are two or more reports issued for the same subject matter information, firm policy should indicate that the time limits for assembly of the engagement file should be such that each report is treated as if it were a separate engagement.",
                "response": "All engagment files are archived within 60 days of signing the audit opinion. Archiving of engagment files are the sole responsibility of the engagement partner.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "EQR will not be performed when required.",
                "assessment": "We may decide to utilise an EQR but it is not compulsory for any of our current clients.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Engagement quality reviews will be performed for: \n(i)  Audits of financial statements of listed entities;\n(ii) Audits or other engagements for which an engagement quality review is required by law or regulation; and\n(iii)  Audits or other engagements for which the firm determines that an engagement quality review is an appropriate response to address one or more quality risk - procedure for identifying and monitoring high risk clients and industries\n\nFirm has identified a list of engagements where an EQR will be necessary\n\nThe EQCR must be objective, independent, and have sufficient training, experience, technical expertise, and authority, as well as the ability and time to fulfill this role. The characteristics commonly attributed to a candidate suitable to serve in this role include superior technical knowledge of current accounting and assurance standards and a breadth of experience which would be exhibited at a senior level.",
                "response": "1. List of entities for which EQR is required or necessary and they can then pick from the list\n2. Audit client profile listing (to indicate the risk and where EQR may be necessary and an indication of if the EQR was performed (follow up!))",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "EQR may not be competent to perform the required review or may not have the necessary resources.",
                "assessment": "If you are performing engagements that require an EQR this will always be a risk",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Review the EQR against the considerations provided by the standard",
                "response": "The EQCR must be objective, independent, and have sufficient training, experience, technical expertise, and authority, as well as the ability and time to fulfill this role. The characteristics commonly attributed to a candidate suitable to serve in this role include superior technical knowledge of current accounting and assurance standards and a breadth of experience which would be exhibited at a senior level.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The EQR may not be independent from the engagement and as such may not be objective.",
                "assessment": "Given the size our our entity and the engagment teams the objectivity and independence will always be a risk.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The EQCR cannot be a member of the engagement team and cannot, directly or indirectly, review his or her own work, or make important decisions regarding the performance of the engagement.",
                "response": "If the objectivity of the QCR becomes compromised following a consultation on a specific matter, the firm should appoint an alternate EQCR.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The EQR documentation may be insufficient.",
                "assessment": "The firm is responsible for establishing criteria for the appointment of EQRs and determining their eligibility.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Evaluate documentation of engagement quality reviewer.",
                "response": "Update the EQR procdures ( Appendix F) regularly.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "1. Extent of EQR is insufficient to cover all areas of significant judgement.",
                "assessment": "The decision to conduct an EQR, even if the engagement meets the criteria, and the extent of the EQR, will depend on the engagement’s complexity and associated risks. An EQR will not diminish the engagement partner’s responsibility for the engagement.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The EQR shall include, as a minimum: \n1. Discussion of significant matters with the engagement partner; \n2. Review of the financial statements or other subject matter information and the proposed report; \n3. Review of selected working paper file documentation relating to the significant judgments the engagement team made and the conclusions it reached; and \n4. Evaluation of the conclusions reached in formulating the report and consideration of whether the proposed report is appropriate.",
                "response": "The EQR should complete/consider  all the suggested procedures indicated in  Appendix F, as a minumum.\nThe EQR can use is professional judgement and add additional procedures as dictated by the engagement.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "1. Timeliness of EQR is not sufficient to provide for timely support or feedback.",
                "assessment": "EQR must be done before the audit report is signed.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "An EQR is required before dating any audit of the financial statements of listed entities. In any other circumstances where an EQR is conducted, the engagement report shall not be dated until completion of the EQR.",
                "response": "Timely involvement by the Engagement Quality Control Reviewer (EQR)",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            }
        ]
    },
    {
        "module": "Resources",
        "quality_objective": "Personnel are hired, developed and retained and have the competence and capabilities to:\n1. Consistently perform quality engagements, including having knowledge or experience relevant to the engagements the firm performs\n2. Perform activities or carry out responsibilities in relation to the operation of the firm’s system of quality management",
        "risks": [
            {
                "description": "Poor  work commitment and quality is not identified, evaluated and addressed.",
                "assessment": "The firm has put in place a system to evaluated performance on a consitent basis. However due to the subjective nature of the process the risk exist that poor performing staff may not identified.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "1. The frims quality standard are tought during training and on the job.\n2. All audit clerks are required to complete the audit training plan to aissis with their competence\n3. All audit clerks comply with the LTS policy",
                "response": "1.Audit training progress are monitored every 6 months \n2. Skills reviews are required to be completed after every two months \n3. Annual needs analysis are competed every six months to assess traninees progress/competency\n4. Senior audit staff are required to maintain and complete CPD for ICAN and PAAB",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The firm may not identify the need for external resources in a timely manner\n\nIndividuals from external sources may not have the necessary competence\n\nExternal sources and service providers used may not be appropriate for the specific engagement\n\nThere may be unforeseen needs on a specific engagement, and the partner may not identify or respond to these needs timeously",
                "assessment": "Very rare that the firm will use individuals from external sources. In the event that I do, I will evaluate their appropriateness.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Ad hoc evaluation of resources necessary\n\nEvaluate the competence and capabilities of all external parties used\n\nProper engagement level evaluation of resources required - responsibility of partner",
                "response": "1. Where external resources is required, the PARTNER will assess the need.\n2. Prior to accepting external resources the Partner will assess the skill, competency and the independence of the resource identified.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Engagement team members are assigned to each engagement, including an engagement partner, who have inappropriate competence and capabilities.",
                "assessment": "Engagment team selection is recommended by the audit supervisor and approved by the engagment Partner",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "When determining the appropriate personnel to assign to an engagement, particular attention will be given to their technical knowledge, qualifications and experience. Continuity with the client, balanced with rotation requirements, will also be considered.",
                "response": "1. Audit planner.\n2. Develepment needs asessement as per LTS.\n3. Skill and competence required to complete the assignment.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The audit budget may be too small and may not provide for sufficient time to perform the engagement",
                "assessment": "evaluate audit fees charged internally vs audit fees actually billed\nDiscuss with team members the time they spend and do not book",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Increase audit fees each year to build up proper budget\nDiscuss matters with client that may not be part of the audit\nDecline engagements where they cannot pay the fees",
                "response": "1.Engagement budget.\n2. Overrun discussions.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "See Governance and leadership",
                "assessment": "See Governance and leadership",
                "likelihood": "nan",
                "adverse_effect": "nan",
                "risk_applicable": "See Governance and leadership",
                "response": "See Governance and leadership",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Individuals from external sources may not have the necessary competence\n\nExternal sources and service providers used may not be appropriate for the specific engagement\n\nUse of external individuals may lead to breach in confidentiality",
                "assessment": "External sources will always be at risk for not being appropriate or not having the required competence, will always have to be evaluated\n\nVery rare that the firm may use external resources, where it does occur they will be evaluated in detail",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm has a policy to identify and evaluate external providers to ensure we only use appropriate service providers.\n\nEvaluate the competence and capabilities of all external parties used\n\nConsider resources provided by Network.",
                "response": "1. Where external resources is required, the PARTNER will assess the need.\n2. Prior to accepting external resources the Partner will assess the skill, competency and the independence of the resource identified.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The technological resources used by the firm may not be appropriate for its function\n\nJudgements and conclusions made are inappropriate due to reliance on inappropriate technological resources\n\nUnauthorised access due to the use of IT",
                "assessment": "This is always a risk to consider and all technological resources must be evaluated.\n\nReasons why technological resources may no longer be appropriate:\n1. Lack of updates\n2. Updates may cause changes in functionality of resource\n3. Custom developed technology not functioning properly\n4. Faulty technological resources\n\nRisk of unauthorised access is increased if the firm uses internet connections",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Evaluate all technological resources used to ensure their output or function is appropriate. \nIT security measures such as firewalls, encryption, access controls, anti-virus and policies and procedures to ensure employees understand these",
                "response": "1. The frim as a dedicated IT department responsible for the technology and its updates\n2. The firm use the following technology to carry out its assurance function;\n2.1. Caseware \n2.2. Caseware IDEA\n2.3. Office 365",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "External sources and service providers used may not be appropriate for the specific engagement\n\nThe technological resources used by service providers may not be appropriate for its function\n\nJudgements and conclusions made are inappropriate due to inappropriate technological resources",
                "assessment": "This is always a risk to consider and all technological resources must be evaluated.\n\nReasons why technological resources may no longer be appropriate:\n1. Lack of updates\n2. Updates may cause changes in functionality of resource\n3. Custom developed technology not functioning properly\n4. Faulty technological resources\n5. Confidentiality breaches due to external access to data",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm has a policy to identify and evaluate external providers to ensure we only use appropriate service providers.\n\nThe engagement partner shall evaluate the appropriateness of the resources utilised and evaluate the judgements and conclusions made based on these resources",
                "response": "1. The frim as a dedicated IT department responsible for the technology and its updates\n2. The firm use the following technology to carry out its assurance function;\n2.1. Caseware \n2.2. Caseware IDEA\n2.3. Office 365",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The intellectual resources used by the firm may not be appropriate for its function\n\nJudgements and conclusions made are inappropriate due to reliance on inappropriate intellectual resources",
                "assessment": "This is always a risk to consider and all intellectual resources must be evaluated.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Evaluate all intellectual resources used to ensure they are appropriate.",
                "response": "Documented the intellectual resources used. Documented the outcome of evaluations of these resources. Communicated the resources to the firm.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "External sources and service providers used may not be appropriate for the specific engagement",
                "assessment": "The firm does make use of intellectual resources from service providers",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm has a policy to identify and evaluate external providers to ensure we only use appropriate service providers.\n\nThe engagement partner shall evaluate the appropriateness of the resources utilised and evaluate the judgements and conclusions made based on these resources",
                "response": "1. Where external resources is required, the PARTNER will assess the need.\n2. Prior to accepting external resources the Partner will assess the skill, competency and the independence of the resource identified.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            }
        ]
    },
    {
        "module": "Information and communication",
        "quality_objective": "The information system identifies, captures, processes and maintains relevant and reliable information that supports the system of quality management, whether from internal or external sources",
        "risks": [
            {
                "description": "The quality management system may not be properly captured and documented\n\nWe do not know how to document it.\n\n\nThere is not sufficient time to maintain the documentation.",
                "assessment": "The quality management system is documented in the Quality Management Manual ( QMM).\nThere is a risk that the QMM may be incomplete or outated.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Formal documented policy in the form of a manual and policies and procedures. All actions taken are documented and evidenced.",
                "response": "Manual and annexures",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The system may not be maintained properly",
                "assessment": "The practitioner must maintain and update the system and may not have the time.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The quality management policies and procedures are a key part of the firm’s internal control system. While partners and staff at all levels should continually strive to meet quality, ethics, and professional and firm standards, those who are in a position to make decisions or oversee the work of others have a greater level of responsibility for day to day monitoring and enforcement of the quality management policies and procedures.",
                "response": "Quality management review will take place .\n\nMonitoring procedures take place annually where the SoQM is evaluated and documentary evidence inspected.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Information may be exchanged inappropriately.",
                "assessment": "Information is normally shared with the engagment team on the audit file.\nThird party access to firm/engagment information is limited to authorised personal on the cloud.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm has reliable and relevant information includes information that is accurate, complete, timely and valid to enable the proper functioning of the firm’s system of quality management and to support decisions regarding the system of quality management.",
                "response": "Engagment team exchange of information is always encoruaged ( Discussions and writen communication)\nClient personal are given access to the clould  allow for access to information.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Irelevant and unreliable information is exchanged throughout the firm and with engagement teams.",
                "assessment": "Engagment information is normally partner led.\nGeneral office communication is led by the office admin department.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm establishes policies or procedures that address obtaining, generating or using information regarding the system of quality management, and communicating information within the firm and to external parties on a timely basis to enable the design, implementation and operation of the system of quality management.",
                "response": "Email from Parner and Office Admistration.\nAll policies are sored on the network and is accessible to all staff.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Material Irregularities (MI) may not be identified or reported as necessary.",
                "assessment": "This will only be a risk if you provide Audit or IR engagements",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "Implement a formal procedure to evaluate and communicate an MI.\nCommunicate with the client the requirements for MI reporting as per the PAAB act section 26(3) b",
                "response": "MI reporting agreed in the engagment letter.\nMI reporting are discuss with TCWG.\nPAAB informed of MI if necessary. \nMI training to audit staff.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "NOCLAR requirements under the code of conduct may not be complied with.\n\n1. Understand or are not aware of the communication requirements\n\n2. Risk that you struggle to communicate with the relevant party\n\n3. There is no party to communicate to or we do not know who the party is.",
                "assessment": "This is always a risk for the accounting profession regardless of the services you provide",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm establishes policies or procedures that address obtaining, generating or using information regarding the system of quality management, and communicating information within the firm and to external parties on a timely basis to enable the design, implementation and operation of the system of quality management.",
                "response": "1. Training to understand the requirements/read the code\n\n2. Formal process to report\n\n3. Legal consult",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Suspicious transactions under FICA may not be reported due to lack of ncerstanding",
                "assessment": "Always a risk in the accounting profession that you may becoe a ware of ollegal dealings within the client",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "1. Training on FIA requirements Suspicious Activity Reporting (SAR) .\n2. ICAN FICA guide.\n3. Emphasis SAR reprorting requirments during the planning meetings.",
                "response": "SAR reporting agreed in the engagment letter.\nSAR training to audit staff.",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "The responsibility to communicate back to the service provider has not been assigned to anyone",
                "assessment": "nan",
                "likelihood": "No",
                "adverse_effect": "No",
                "risk_applicable": "nan",
                "response": "nan",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            },
            {
                "description": "Consider where other communication may be necessary due to legal requirements (for example where an engagement is performed for a regulatory body)",
                "assessment": "Rsk depends on the type of clients.",
                "likelihood": "Yes",
                "adverse_effect": "Yes",
                "risk_applicable": "The firm communicates the responsibility for implementing the firm’s responses to personnel and engagement teams.",
                "response": "Reporting to thrid parties are discussed , confirmed and agreed with TCWG in the engagment letter.\nOur audit report will include the reporting requirements to regulators",
                "firm_implementation": "nan",
                "toc": "nan",
                "monitoring_activity": "nan",
                "findings": "nan",
                "deficiency_type": "nan",
                "root_cause": "nan",
                "severe": "nan",
                "pervasive": "nan",
                "remedial_action": "nan"
            }
        ]
    }
]